package day4;

public class coment {
    public static void main(String[] args) {

//         자바 프로그램 시작 -> 자바파일 생성(클래스)
//         코드가 많아지면 함수를 이용해서 쪼갠다. 변수가 많아지면 쪼갠다 -> 클래스
//         클래스에 비슷한 성격의 데이터와 함수를 묶는다.
//         main에서 불러서 사용 1.class를 직접 사용하는 방법(static) 2. class의 복사본인 객체를 생서해서 사용하는 방법 (non-static)
//         객체의 개성(나이, 이름, 거주지)을 표현할 때는 non-static 모든 객체가 동일하게 사용하는 공유 정보(인류 평균 나이)는 static
//         static이 붙은것은 static이 붙지 않은 것을 사용할 수 없다. 반대는 가능하다
//         프로그래밍 -> 중복과의 싸움
//         데이터의 중복 -> 변수
//         코드의 중복 -> 함수
//         변수/함수의 중복 -> 클래스, 객체
//         객체의 중복 -> 상속
    }
}
